/**
 * Created by PC on 10/14/2016.
 */
var itemsInfo = [//type为物品生效类型0:立即自动生效；1:条件触发自动生效; 2:手动生效
  {id:1, name:"yellowKey", img:"items", type:1}
  ,{id:2, name:"blueKey",img:"items", type:1}
  ,{id:3, name:"redKey", img:"items", type:1}
  ,{id:4, name:"magicKey", img:"items", type:1}
  ,{id:5, name:"redHP", img:"items", type:0, func:{HP:50}}
  ,{id:6, name:"blueHP", img:"items", type:0, func:{HP:200}}
  ,{id:7, name:"ruby", img:"items", type:0, func:{ATK:1}}
  ,{id:8, name:"sapphire", img:"items", type:0, func:{DEF:1}}
  ,{id:9, name:"ironSword", img:"items", type:0, func:{ATK:10}}
  ,{id:10, name:"ironShield", img:"items", type:0, func:{DEF:10}}
];
var enemyInfo = [
  {id:1, name:"greenSlime", img:"slime", imgIndex:0
    ,property:{HP: 35, ATK: 18, DEF: 1, gold: 1}}
  ,{id:2, name:"redSlime", img:"slime", imgIndex:1
    ,property:{HP: 45, ATK: 20, DEF: 2, gold: 2}}

];
var doorInfo = [
  {id:1, name:"yellowDoor", img:"map", imgIndex:4, keyId: 1}
  ,{id:2, name:"blueDoor", img:"map", imgIndex:5, keyId: 2}
  ,{id:3, name:"redDoor", img:"map", imgIndex:6, keyId: 3}
  ,{id:4, name:"GreenDoor", img:"map", imgIndex:7, keyId: 4}
  ,{id:5, name:"ironDoor", img:"map", imgIndex:11, keyId: 5}
  ,{id:6, name:"wallDoor", img:"map", imgIndex:1, keyId: 6}
];
var script = {
  floor01: {
    domain: 1,
    map: [
      [12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0],
      [0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0],
      [1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0],
      [0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0],
      [1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1],
      [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0],
      [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0]
    ],
    mapdata: [
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0],
      [0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0],
      [1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0],
      [0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0],
      [1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1],
      [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0],
      [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0]
    ],
    door: [
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0],
      [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    ],
    hero: {
      name: "勇士",
      img: "hero",
      property:{
        HP: 1000,
        ATK: 100,
        DEF: 100,
        gold: 0
      },
      pack:{
      },
      x: 5,
      y: 10
    },
    enemy: [
      [0, 0, 1, 2, 1, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1]
    ],
    items: [
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [5, 0, 0, 0, 0, 0, 7, 1, 0, 0, 0],
      [0, 0, 0, 0, 1, 0, 8, 5, 0, 0, 0],
      [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
      [1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [5, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0],
      [5, 0, 1, 0, 0, 0, 0, 0, 0, 6, 0]
    ],
    jump: [
      {name: "up", at: {x: 0, y: 0}, to: "floor02", targetAt: {x: 5, y: 9}}
    ]
  }
   ,floor02:{
    map: [
      [12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0],
      [0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0],
      [1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0],
      [0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0],
      [1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1],
      [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0],
      [0, 0, 0, 1, 0, 13, 0, 1, 0, 0, 0]
    ],
    mapdata: [
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0],
      [0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0],
      [1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0],
      [0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0],
      [0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0],
      [1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1],
      [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0],
      [0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0]
    ],
    door:[
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 3, 0, 0, 0, 0, 0, 0, 3, 0, 0],
      [0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 3, 0, 0, 0, 3, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    ],
    hero:{
      name:"勇士",
      img:"hero",
      x:5,
      y:9
    },
    enemy: [
      [0, 0, 1, 2, 1, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1]
    ],
    items: [
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [5, 0, 0, 0, 0, 0, 7, 1, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 8, 5, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      [5, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0],
      [5, 0, 1, 0, 0, 0, 0, 0, 0, 6, 0]
    ],
    jump:[
      {name:"up",at:{x:0,y:0},to:"floor03",targetAt:{x:5,y:9}},
      {name:"down",at:{x:5,y:10},to:"floor01",targetAt:{x:1,y:0}}
    ]
  }
};

//根据脚本，初始化游戏画面
function scriptInit(floor) {

  //地图层初始化
  mapLayer.removeAllChild();
  doorLayer.removeAllChild();
  itemLayer.removeAllChild();
  //人物层初始化
  npcLayer.removeAllChild();
  enemyLayer.removeAllChild();
  playerLayer.removeAllChild();
  //效果层初始化
  effectLayer.removeAllChild();
  //对话层初始化
  talkLayer.removeAllChild();

  //地图数据获取
  map = floor.map;
  mapdata = floor.mapdata;

  //添加地图
  addMap();
  addDoor();
  addEnemy();
  addItems();
  addHero();
}
/**
 * 楼层跳转
 */
function checkJump(current_floor){
  var jumpfloor = current_floor.jump;
  var position = hero.getPosition();
  for(var i=0;i<jumpfloor.length;i++){
    if(position.x == jumpfloor[i].at.x && position.y == jumpfloor[i].at.y){
      //获取该楼层脚本数据
      floor = script[jumpfloor[i].to];
      floor.hero.x = jumpfloor[i].targetAt.x;
      floor.hero.y = jumpfloor[i].targetAt.y;
      //开始跳转
      scriptInit(floor);
      return;
    }
  }
}